public class Lecture_3 {
    /*
    JavaFX - библиотека для пользовательских интерфейсов.
    Пользоваться приятно, много возможностей.
    (были: awt, swing(IDEA))

    Будет много аналогий с вебом.
    С помощью CSS можно описать какие-нибудь кнопки, другие элементы.
    Есть FXML (~HTML) - описание струткуры объекта.

    Button - аккуратно с import'ом (color?).

    Мы - пишем на Java.
    Другие способы - FXML, SceneBuilder.

    Можно в программы на JavaFX вставлять браузер.
    Много встроенных компонентов(кнопочек, слайдеров итд).
    Есть Canvas.
    Можно создавать самостоятельные приложения.
    JavaFX - не нативный интерфейс (на разных системах выглядит одинаково, "кнопочки рисующиеся не зависят от системы").
    Node - элемент интерфейса.
    Parent - такой Node, у которого есть подузлы.
    Не Parent мб кнопки, слайдеры, другие панели.
    ImageView - не Parent !

    Parent бывают двух видов - Group и Region.
    У Region есть свой размер, есть рамка.
    У Group есть только размер содержимого.

    Region делятся на Control и Pane.
    Control - кнопки, слайдеры, тексты.
    Pane - располагает на себе другие Node. Обычно Control и Pane.
    Pane - HBox, VBox, GridPane...
     */
}
